In [1]:
import numpy as np
from pandas import Series,DataFrame

In [2]:
df1 = DataFrame(np.arange(1,17).reshape(4,4))
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [3]:
df1.sum(axis=0)   #행별(서로 다른 행끼리--> 열의 합)

0    28
1    32
2    36
3    40
dtype: int64

In [4]:
df1.sum(axis=1)   #열(컬럼)별(서로 다른 열끼리--> 행의 합)

0    10
1    26
2    42
3    58
dtype: int64

In [5]:
df1.iloc[:,0]

0     1
1     5
2     9
3    13
Name: 0, dtype: int32

In [6]:
df1.iloc[:,0].sum()

28

In [7]:
df1.iloc[:,0].mean()

7.0

In [8]:
df1.iloc[0,0] = np.nan
df1

      0   1   2   3
0   NaN   2   3   4
1   5.0   6   7   8
2   9.0  10  11  12
3  13.0  14  15  16

In [10]:
df1.iloc[:,0].mean()
#skipna = True 가 default(NaN 값이 있으면 skip)
#--> 자동으로 NaN 무시하고 연산

9.0

In [12]:
df1.iloc[:,0].isnull()

0     True
1    False
2    False
3    False
Name: 0, dtype: bool

In [13]:
df1.iloc[:,0][df1.iloc[:,0].isnull()]

0   NaN
Name: 0, dtype: float64

In [14]:
df1.iloc[:,0][df1.iloc[:,0].isnull()] = df1.iloc[:,0].mean()
df1

<ipython-input-14-b29dc35a3a8c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.iloc[:,0][df1.iloc[:,0].isnull()] = df1.iloc[:,0].mean()

      0   1   2   3
0   9.0   2   3   4
1   5.0   6   7   8
2   9.0  10  11  12
3  13.0  14  15  16

In [15]:
df1[df1.isnull()]   #데이터프레임 전체에서 NaN값 확인

    0   1   2   3
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN

In [16]:
df1[df1.notnull()]  #데이터프레임 전체에서 Null이 아닌 값 출력

      0   1   2   3
0   9.0   2   3   4
1   5.0   6   7   8
2   9.0  10  11  12
3  13.0  14  15  16

In [17]:
df1.iloc[:,0]

0     9.0
1     5.0
2     9.0
3    13.0
Name: 0, dtype: float64

In [18]:
df1.iloc[:,0].var() #분산

10.666666666666666

In [19]:
df1.iloc[:,0].std() #표준편차

3.265986323710904

In [20]:
df1.iloc[:,0].min() #최소값

5.0

In [21]:
df1.iloc[:,0].max() #최대값

13.0

In [22]:
df1.iloc[:,0].median() #중앙값(중위수)

9.0

In [23]:
df1.iloc[:,0] >= 10

0    False
1    False
2    False
3     True
Name: 0, dtype: bool

In [24]:
(df1.iloc[:,0] >= 10).sum()  #조건에 만족하는 개수 확인(True개수)

1